whatsappPositivo/app/Http/Controllers/PagesController.php

select * from `pages` where (`showAsLink` = 1)
---
    public function getPages()
    {
        return response()->json([
            'data' => Pages::where(['showAsLink'=>1])->get(),
        ]);